app/controllers/items_controller.rb

SELECT "items".* FROM "items"  WHERE (Manufacturer like '%fake%')  ORDER BY created_at DESC
---
  def index
    @items = Item.all

INSERT INTO "items" ("cateogyr", "created_at", "manufacturer", "name", "picture", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cateogyr", "Electronics"], ["created_at", "2015-04-09 17:35:58.283341"], ["manufacturer", "Dr Dre"], ["name", "Beats "], ["picture", "beats.jpg"], ["updated_at", "2015-04-09 17:35:58.283341"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save